$ ->
  qa = [
    {
      'title': '會員管理'
      'list': [
        {
          'question': '帳號出現問題，無法登入？'
          'answer': '您的帳號是註冊申請學院會員時填寫的email信箱，請務必填入完整信箱資料。例如：1234@gmail.com。如忘記email信箱，請聯絡雲端學院客服中心。'
        }
        {
          'question': '如何修改註冊帳號及密碼？'
          'answer': '登入學院後，可至個人資料頁修改註冊帳號及密碼。（如修改個人信箱需重新驗證）'
        }
        {
          'question': '忘記密碼，無法登入？'
          'answer': '請在會員登入頁面内點擊忘記密碼，系統將會發出一組臨時密碼至您的email信箱，請您至信箱內查收，使用臨時密碼登入學院即可。登入後，可於個人資料頁重新設定個人密碼。'
        }
        {
          'question': '收不到認證信？'
          'answer': '請檢查您的email信箱内的垃圾郵件或聯絡雲端客服中心。'
        }
        
      ]
    }
    {
      'title': '訂購開通'
      'list': [
        {
          'question': '如何購買課程？'
          'answer': '方法1：線上購物 - 您可在學院首頁點擊「課程購買」，選擇您要購買的課程加入購物車。完成結帳即可使用課程。<br/><br/>方法2：<a href="/about.html?distributors" target="_blank"> 雲端經銷據點</a>'
        }
        {
          'question': '線上購物付款方式？'
          'answer': '方法1：使用信用卡付款：輸入卡號、有效年月、及卡片背面末三碼，確認送出後完成付款。<br/><br/>' + '方法2：便利商店繳款：<br/><br/>' + '7-11(i-bon)繳款流程如下:<br/>' + ' i-bon左上角點選(代碼輸入)→輸入繳費代碼→確認訂單內容→列印繳款單→櫃檯繳款→完成付款→約1小時後登入雲端學院,至「我的課程」確認擁有購買之產品→開始享受雲端學院課程及完整服務。<br/>' + '操作示意圖:<a href="https://www.spgateway.com/info/site_description/seven_ibon_embedded" target="_blank">https://www.spgateway.com/info/site_description/seven_ibon_embedded</a><br/><br/>' + '全家繳款流程如下:<br/>' + '選擇繳費→選擇代碼繳費→確認同意條款→輸入繳款代碼→列印繳款單→櫃檯繳款→完成付款→約1小時後登入雲端學院,至「我的課程」確認擁有購買之產品→開始享受雲端學院課程及完整服務。<br/>' + '操作示意圖:<a href="https://www.spgateway.com/info/site_description/family_embedded" target="_blank">https://www.spgateway.com/info/site_description/family_embedded</a><br/><br/>' + 'OK便利商店繳款流程如下:<br/>' + '選擇繳費→點選網路交易→選擇代碼繳費→確認同意條款→輸入繳費代碼→列印繳款單→櫃檯繳款→完成付款→約1小時後登入雲端學院,至「我的課程」確認擁有購買之產品→開始享受雲端學院課程及完整服務。<br/>' + '操作示意圖:<a href="https://www.spgateway.com/info/site_description/okshop_embedded" target="_blank">https://www.spgateway.com/info/site_description/okshop_embedded</a><br/><br/>' + '萊爾富繳款流程如下:<br/>' + '選擇繳費.代收→選擇代碼輸入→確認同意條款→輸入繳費代碼→列印繳款單→櫃檯繳款→完成付款→約1小時後登入雲端學院,至「我的課程」確認擁有購買之產品→開始享受雲端學院課程及完整服務。<br/>' + '操作示意圖:<a href="https://www.spgateway.com/info/site_description/hilife_embedded" target="_blank">https://www.spgateway.com/info/site_description/hilife_embedded</a><br/><br/>' + '<div style="color: red">請注意,便利超商繳款期限皆以五日為限,逾期請重新下單取得新繳費代碼。</div><br/><br/>' + '方法3:ATM 轉帳繳款:<br/>' + '(1)在您完成結帳流程後,購物車步驟最後一頁將會產生一組專屬於這筆訂單的ATM虛擬轉帳帳號,如您持有玉山銀行、台灣銀行、台新銀行帳號之用戶,可享跨行免轉帳手續費;若您無以上金融機構發行之金融卡,可依您喜好選擇其中一家金融機構取得ATM轉帳帳號,請您根據此組虛擬帳號及您購買的總金額進行轉帳即可。轉帳後您無需再回傳收據,或回填任何已匯款資訊。<br/>' + '(2)繳款完成後,請於1個工作天內登入雲端學院,至「我的課程」確認擁有購買之產品。<br/>' + '(3)初次使用ATM 轉帳方式繳款者,請參考「ATM 跨行轉帳操作步驟」示意圖: <a href="/atm_help.html" target="_blank">https://www.ehanlin.com.tw/atm_help.html</a><br><br>' + '轉帳注意事項 :<br>' + '(1)由於銀行作業時間為週一至週五（不包含例假日），若您為週五進行ATM轉帳匯款，因逢例假日，款項需延遲至次個工作日(星期一)才會入帳，雲端學院系統將延於星期一成功開通您所購買之課程，請特別留意!!<br>' + '(2)由於轉帳帳號為虛擬帳號，一旦過了繳費期限，該帳號就不再存在，該筆訂單亦會自動取消。<font style="color: red;">若是逾期未繳款，煩請您重新訂購，系統會再次給您一組新的轉帳帳號和新的繳款期限。</font><br><br>' + '轉帳開通問題 :<br>' + '(1)若您在付款後2個工作日後「我的課程」中，您訂購的課程狀態仍無法開通使用，請將轉帳單據傳真至雲端學院，並註明雲端帳號、購買人姓名及聯絡電話，傳真後請再來電客服中心，客服人員將會盡快為您查詢及處理。<br>' + '傳真電話：02-66219399  客服專線 : 0800-008811<br>'
        }
        {
          'question': '線上購買後如何知道課程已開通？'
          'answer': '當你完成付款後，系統在30分鐘內會將您購買的課程開通至您的雲端帳號內，只要登入點選「我的課程」即可使用。<br>' + '如您繳款方式為「ATM 轉帳」，轉帳成功後，您的課程將於一天內直接開通於您的雲端帳號內，只要登入點選「我的課程」即可使用。<br><br>' + '開通注意事項 :<br>' + '(1)由於銀行作業時間為週一至週五（不包含例假日），若您為週五進行ATM轉帳匯款，因逢例假日，款項需於次個工作日(星期一)才會入帳，最晚於星期一雲端學院系統才能確認轉帳成功及開通您購買之課程，請特別留意 !!<br>'
        }
        {
          'question': '線上購買學院課程後，我的發票（與高中ｅ名師紙本講義）何時會收到？'
          'answer': '翰林雲端學院將在完成付款後的7個工作天寄出您的購買發票（及講義）。送達的時間會依您的寄送地址遠近而有所不同。'
        }
        {
          'question': '開通碼開通無效或損壞？'
          'answer': '請確認您的開通碼還未被使用，並檢查輸入碼與刮開的開通碼相同。如還無法開通，請聯絡雲端學院客服中心。<br/>如您的開通碼有損壞，請將開通卡損壞的樣子拍下來，存成圖片照片檔案。將照片以附件方式寄送到翰林雲端學院客服中心（<a href="mailto:support@ehanlin.com.tw">support@ehanlin.com.tw</a>）即可，收到後我們會盡快處理確認。'
        }
        {
          'question': '如何辦理退換貨？'
          'answer': '1.辦理退換貨，請於十天猶豫期內透過雲端學院客服中心與我們聯繫進行相關作業。' + '辦理退換貨之商品需保持商品原先的狀態與完整性，並以掛號或是包裹寄回雲端學院，' + '雲端學院收到退回商品及發票後，會儘快處理後續退款換貨事宜。<br>' + '寄回地址︰23585 新北市中和區建一路 136號7樓 雲端學院客服中心 收。<br><br>' + '2.如為消費者自行購買錯誤退回更換之商品，消費者需自行負擔退換貨之往返運費，如有申請退款，雲端學院退款金額將扣除代墊之運費。<br><br>' + '3.折讓單︰若發票日期已過申報期限無法直接作廢，則會寄出銷貨折讓單給您，需請您親自簽名後，將折讓單前二聯連同商品一併寄回雲端學院。商品、發票(折讓單)' + '順利收回檢查無誤後，我們會儘快處理退款事宜。<br><br>' + '非常感謝您的支持與協助，若還有疑問，也歡迎您利用雲端學院官網線上諮詢系統詢問<br>' + '* 雲端學院客服中心︰e-mail︰support@ehanlin.com.tw<br>' + '* 市話客服免費諮詢專線 : 0800-0088-11，手機請撥打 (02) 8228-2575 謝謝。雲端學院客服團隊感謝您'
        }
      ]
    }
    {
      'title': '課程使用'
      'list': [
        {
          'question': '如何設定與修改課程版本？'
          'answer': '從「我的課程」内點選該課程進入課程，點選右上角(其他)進入教材設定修改版本。'
        }
        {
          'question': '課程使用期限？'
          'answer': '單冊課程：開通後有效使用期限為一年（開通日+365天後過期）。<br/><br/>' + '全學年組合課程：開通後有效使用期限為一年半（開通日+548天後過期）。<br/><br/>' + '課程內測驗紀錄，將延長保留至學生畢業年度。<br/><br/>' + '<font style="color:red">※在「我的課程」内點選該課程名稱可隨時查看課程使用期限。</font>'
        }
        {
          'question': '如何續購課程？'
          'answer': '「我的課程」内點選該課程名即可加購，一次加購期限為6個月。'
        }
        {
          'question': '何謂「學習通知」？'
          'answer': '1.專為家長設計的「學習通知」服務，透過便利的功能讓家長可看到孩子每天在雲端學院内的學習歷程（看了多少影片、答對了多少題目），可以放心地讓孩子獨立學習。<br>' + '2.使用方式：進入翰林雲端學院 line@ → 選擇帳號綁定 → 選擇家長身分、學號或訂購人手機進行綁定 → 確認資料無誤點選「完成」→ 完成綁定，進入設定頁面。'
        }
        {
          'question': '沒收到學習活動獎勵？'
          'answer': '學習活動獎勵電子票券會在回填領取獎勵後5-7天內寄到您的雲端電子信箱，若期間沒有收到請檢查您的email信箱内的垃圾郵件或聯絡雲端客服中心。'
        }
      ]
    }
  ]

  $.each qa, (idx, val) ->
    $('.qa-list').append $('#qaTemplate').tmpl($.extend({ qaIdx: idx }, val))
    return
    
  $('.category li').click ->
    _this = $(this)
    item = qa[_this.data('qa-idx')].list[_this.data('list-idx')]
    $('.question').html 'Q: ' + item.question
    $('.answer').html item.answer
    $('.selected').removeClass 'selected'
    _this.addClass 'selected'
    $('.qa').show()
    return
  return
